freesbeeGE/test/dati/g/test11.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:ge="http://ge.freesbee.unibas.it/">
    <SOAP-ENV:Body>
        <ge:pubblicaMessaggio>
            <messaggioSoap>
                <confermaPubblicatori>
                    <pubblicatore>
                        <nomePubblicatore>K</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <pubblicatore>
                        <nomePubblicatore>J</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <nomeSottoscrittore>M</nomeSottoscrittore>
                    <tipoSottoscrittore>SPC</tipoSottoscrittore>
                    <categoriaSottoscrizione>Test30</categoriaSottoscrizione>
                </confermaPubblicatori>
            </messaggioSoap>
            <nomePubblicatore>GE</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:pubblicaMessaggio>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>